{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv3D", "config": {"dilation_rate": [1, 1, 1], "use_bias": true, "kernel_regularizer": null, "batch_input_shape": [null, 32, 32, 15, 3], "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "filters": 32, "name": "conv3d_1", "kernel_size": [3, 3, 3], "bias_constraint": null, "activation": "linear", "strides": [1, 1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "activity_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Conv3D", "config": {"dilation_rate": [1, 1, 1], "use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3, 3], "kernel_constraint": null, "bias_regularizer": null, "filters": 32, "name": "conv3d_2", "trainable": true, "bias_constraint": null, "activation": "linear", "strides": [1, 1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_2"}}, {"class_name": "MaxPooling3D", "config": {"strides": [3, 3, 3], "padding": "same", "data_format": "channels_last", "name": "max_pooling3d_1", "pool_size": [3, 3, 3], "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "noise_shape": null, "seed": null, "name": "dropout_1"}}, {"class_name": "Conv3D", "config": {"dilation_rate": [1, 1, 1], "use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3, 3], "kernel_constraint": null, "bias_regularizer": null, "filters": 64, "name": "conv3d_3", "trainable": true, "bias_constraint": null, "activation": "linear", "strides": [1, 1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Conv3D", "config": {"dilation_rate": [1, 1, 1], "use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3, 3], "kernel_constraint": null, "bias_regularizer": null, "filters": 64, "name": "conv3d_4", "trainable": true, "bias_constraint": null, "activation": "linear", "strides": [1, 1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_4"}}, {"class_name": "MaxPooling3D", "config": {"strides": [3, 3, 3], "padding": "same", "data_format": "channels_last", "name": "max_pooling3d_2", "pool_size": [3, 3, 3], "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "noise_shape": null, "seed": null, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "trainable": true, "activation": "sigmoid", "bias_constraint": null, "units": 512, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "noise_shape": null, "seed": null, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "trainable": true, "activation": "softmax", "bias_constraint": null, "units": 10, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_1"}}