{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv3D", "config": {"kernel_regularizer": null, "kernel_size": [3, 3, 3], "trainable": true, "batch_input_shape": [null, 32, 32, 16, 3], "name": "conv3d_1", "filters": 32, "strides": [1, 1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "padding": "same", "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_1"}}, {"class_name": "Conv3D", "config": {"kernel_regularizer": null, "trainable": true, "padding": "same", "name": "conv3d_2", "kernel_constraint": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3, 3], "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1, 1]}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_2"}}, {"class_name": "MaxPooling3D", "config": {"pool_size": [3, 3, 3], "trainable": true, "strides": [3, 3, 3], "name": "max_pooling3d_1", "padding": "same", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Conv3D", "config": {"kernel_regularizer": null, "trainable": true, "padding": "same", "name": "conv3d_3", "kernel_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3, 3], "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1, 1]}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_3"}}, {"class_name": "Conv3D", "config": {"kernel_regularizer": null, "trainable": true, "padding": "same", "name": "conv3d_4", "kernel_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3, 3], "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1, 1]}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_4"}}, {"class_name": "MaxPooling3D", "config": {"pool_size": [3, 3, 3], "trainable": true, "strides": [3, 3, 3], "name": "max_pooling3d_2", "padding": "same", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_2", "rate": 0.25}}, {"class_name": "Conv3D", "config": {"kernel_regularizer": null, "trainable": true, "padding": "same", "name": "conv3d_5", "kernel_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3, 3], "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1, 1]}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_5"}}, {"class_name": "Conv3D", "config": {"kernel_regularizer": null, "trainable": true, "padding": "same", "name": "conv3d_6", "kernel_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1, 1], "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3, 3], "data_format": "channels_last", "activity_regularizer": null, "strides": [1, 1, 1]}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_6"}}, {"class_name": "MaxPooling3D", "config": {"pool_size": [3, 3, 3], "trainable": true, "strides": [3, 3, 3], "name": "max_pooling3d_3", "padding": "same", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_3", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_1", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 512, "activity_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "gamma_regularizer": null, "epsilon": 0.001, "center": true, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "scale": true}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_4", "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_2", "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "units": 249, "activity_regularizer": null}}], "name": "sequential_1"}}