{"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv3D", "config": {"bias_constraint": null, "dtype": "float32", "strides": [1, 1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "conv3d_1", "batch_input_shape": [null, 32, 32, 16, 1], "activation": "linear", "filters": 32}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_1"}}, {"class_name": "Conv3D", "config": {"bias_constraint": null, "strides": [1, 1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "conv3d_2", "activation": "linear", "filters": 32}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_2"}}, {"class_name": "MaxPooling3D", "config": {"strides": [3, 3, 3], "data_format": "channels_last", "padding": "same", "trainable": true, "pool_size": [3, 3, 3], "name": "max_pooling3d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "rate": 0.25, "seed": null, "name": "dropout_1"}}, {"class_name": "Conv3D", "config": {"bias_constraint": null, "strides": [1, 1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "conv3d_3", "activation": "linear", "filters": 64}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_3"}}, {"class_name": "Conv3D", "config": {"bias_constraint": null, "strides": [1, 1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "conv3d_4", "activation": "linear", "filters": 64}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_4"}}, {"class_name": "MaxPooling3D", "config": {"strides": [3, 3, 3], "data_format": "channels_last", "padding": "same", "trainable": true, "pool_size": [3, 3, 3], "name": "max_pooling3d_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "rate": 0.25, "seed": null, "name": "dropout_2"}}, {"class_name": "Conv3D", "config": {"bias_constraint": null, "strides": [1, 1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "conv3d_5", "activation": "linear", "filters": 64}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_5"}}, {"class_name": "Conv3D", "config": {"bias_constraint": null, "strides": [1, 1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "conv3d_6", "activation": "linear", "filters": 64}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_6"}}, {"class_name": "MaxPooling3D", "config": {"strides": [3, 3, 3], "data_format": "channels_last", "padding": "same", "trainable": true, "pool_size": [3, 3, 3], "name": "max_pooling3d_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "rate": 0.5, "seed": null, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "units": 512, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "relu", "name": "dense_1"}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "beta_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "rate": 0.5, "seed": null, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "units": 249, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "softmax", "name": "dense_2"}}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow"}