{"config": {"layers": [{"config": {"filters": 32, "bias_constraint": null, "data_format": "channels_last", "batch_input_shape": [null, 32, 32, 16, 3], "name": "conv3d_1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dtype": "float32", "bias_regularizer": null, "strides": [1, 1, 1], "activation": "linear", "padding": "same", "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "dilation_rate": [1, 1, 1], "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"filters": 32, "bias_constraint": null, "data_format": "channels_last", "name": "conv3d_2", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "dilation_rate": [1, 1, 1], "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"strides": [3, 3, 3], "pool_size": [3, 3, 3], "padding": "same", "name": "max_pooling3d_1", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"filters": 64, "bias_constraint": null, "data_format": "channels_last", "name": "conv3d_3", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "dilation_rate": [1, 1, 1], "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"filters": 64, "bias_constraint": null, "data_format": "channels_last", "name": "conv3d_4", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "dilation_rate": [1, 1, 1], "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"strides": [3, 3, 3], "pool_size": [3, 3, 3], "padding": "same", "name": "max_pooling3d_2", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"filters": 64, "bias_constraint": null, "data_format": "channels_last", "name": "conv3d_5", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "dilation_rate": [1, 1, 1], "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"filters": 64, "bias_constraint": null, "data_format": "channels_last", "name": "conv3d_6", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1, 1], "activation": "linear", "padding": "same", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "dilation_rate": [1, 1, 1], "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"strides": [3, 3, 3], "pool_size": [3, 3, 3], "padding": "same", "name": "max_pooling3d_3", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling3D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_3", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 512, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"scale": true, "epsilon": 0.001, "name": "batch_normalization_1", "beta_regularizer": null, "beta_constraint": null, "center": true, "momentum": 0.99, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_4", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "name": "dense_2", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 249, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential"}