{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"config": {"dilation_rate": [1, 1, 1], "filters": 32, "trainable": true, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3, 3], "dtype": "float32", "kernel_constraint": null, "name": "conv3d_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "batch_input_shape": [null, 32, 32, 16, 3], "padding": "same", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1, 1]}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"dilation_rate": [1, 1, 1], "filters": 32, "trainable": true, "name": "conv3d_2", "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3, 3], "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1, 1]}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3, 3], "name": "max_pooling3d_1", "padding": "same", "strides": [3, 3, 3]}, "class_name": "MaxPooling3D"}, {"config": {"seed": null, "trainable": true, "name": "dropout_1", "rate": 0.25, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"dilation_rate": [1, 1, 1], "filters": 64, "trainable": true, "name": "conv3d_3", "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3, 3], "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1, 1]}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"dilation_rate": [1, 1, 1], "filters": 64, "trainable": true, "name": "conv3d_4", "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3, 3], "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1, 1]}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3, 3], "name": "max_pooling3d_2", "padding": "same", "strides": [3, 3, 3]}, "class_name": "MaxPooling3D"}, {"config": {"seed": null, "trainable": true, "name": "dropout_2", "rate": 0.25, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"dilation_rate": [1, 1, 1], "filters": 128, "trainable": true, "name": "conv3d_5", "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3, 3], "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1, 1]}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "leaky_re_lu_5", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"dilation_rate": [1, 1, 1], "filters": 128, "trainable": true, "name": "conv3d_6", "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3, 3], "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1, 1]}, "class_name": "Conv3D"}, {"config": {"trainable": true, "name": "leaky_re_lu_6", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [3, 3, 3], "name": "max_pooling3d_3", "padding": "same", "strides": [3, 3, 3]}, "class_name": "MaxPooling3D"}, {"config": {"seed": null, "trainable": true, "name": "dropout_3", "rate": 0.25, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "units": 2048, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dense_2", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "units": 512, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "gamma_regularizer": null, "momentum": 0.99, "axis": -1, "name": "batch_normalization_1", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "epsilon": 0.001, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"seed": null, "trainable": true, "name": "dropout_4", "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "dense_3", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "softmax", "units": 249, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}