{"backend": "tensorflow", "config": {"layers": [{"class_name": "Conv3D", "config": {"padding": "same", "batch_input_shape": [null, 32, 32, 16, 3], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "filters": 32, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3, 3], "bias_regularizer": null, "dilation_rate": [1, 1, 1], "bias_constraint": null, "activation": "linear", "strides": [1, 1, 1], "use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "name": "conv3d_1"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "Conv3D", "config": {"padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3, 3], "name": "conv3d_2", "dilation_rate": [1, 1, 1], "bias_constraint": null, "activation": "linear", "strides": [1, 1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "MaxPooling3D", "config": {"padding": "same", "pool_size": [3, 3, 3], "trainable": true, "data_format": "channels_last", "strides": [3, 3, 3], "name": "max_pooling3d_1"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.25, "seed": null, "trainable": true, "name": "dropout_1"}}, {"class_name": "Conv3D", "config": {"padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3, 3], "name": "conv3d_3", "dilation_rate": [1, 1, 1], "bias_constraint": null, "activation": "linear", "strides": [1, 1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "Conv3D", "config": {"padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3, 3], "name": "conv3d_4", "dilation_rate": [1, 1, 1], "bias_constraint": null, "activation": "linear", "strides": [1, 1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "MaxPooling3D", "config": {"padding": "same", "pool_size": [3, 3, 3], "trainable": true, "data_format": "channels_last", "strides": [3, 3, 3], "name": "max_pooling3d_2"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.25, "seed": null, "trainable": true, "name": "dropout_2"}}, {"class_name": "Conv3D", "config": {"padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3, 3], "name": "conv3d_5", "dilation_rate": [1, 1, 1], "bias_constraint": null, "activation": "linear", "strides": [1, 1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "Conv3D", "config": {"padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3, 3], "name": "conv3d_6", "dilation_rate": [1, 1, 1], "bias_constraint": null, "activation": "linear", "strides": [1, 1, 1], "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.30000001192092896}}, {"class_name": "MaxPooling3D", "config": {"padding": "same", "pool_size": [3, 3, 3], "trainable": true, "data_format": "channels_last", "strides": [3, 3, 3], "name": "max_pooling3d_3"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.25, "seed": null, "trainable": true, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2048, "activation": "relu", "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "activation": "relu", "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "center": true, "scale": true, "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "seed": null, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 249, "activation": "softmax", "name": "dense_3", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential"}