{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "dtype": "float32", "kernel_constraint": null, "use_bias": true, "trainable": true, "padding": "same", "strides": [1, 1, 1], "kernel_regularizer": null, "name": "conv3d_1", "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "batch_input_shape": [null, 32, 32, 16, 3], "dilation_rate": [1, 1, 1], "filters": 32, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "alpha": 0.30000001192092896, "trainable": true}}, {"class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "strides": [1, 1, 1], "name": "conv3d_2", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1, 1], "filters": 32, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "alpha": 0.30000001192092896, "trainable": true}}, {"class_name": "MaxPooling3D", "config": {"pool_size": [3, 3, 3], "trainable": true, "padding": "same", "strides": [3, 3, 3], "name": "max_pooling3d_1", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_1", "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "strides": [1, 1, 1], "name": "conv3d_3", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1, 1], "filters": 64, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "alpha": 0.30000001192092896, "trainable": true}}, {"class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "strides": [1, 1, 1], "name": "conv3d_4", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1, 1], "filters": 64, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "alpha": 0.30000001192092896, "trainable": true}}, {"class_name": "MaxPooling3D", "config": {"pool_size": [3, 3, 3], "trainable": true, "padding": "same", "strides": [3, 3, 3], "name": "max_pooling3d_2", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_2", "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "strides": [1, 1, 1], "name": "conv3d_5", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1, 1], "filters": 64, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "alpha": 0.30000001192092896, "trainable": true}}, {"class_name": "Conv3D", "config": {"kernel_size": [3, 3, 3], "kernel_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "strides": [1, 1, 1], "name": "conv3d_6", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1, 1], "filters": 64, "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "alpha": 0.30000001192092896, "trainable": true}}, {"class_name": "MaxPooling3D", "config": {"pool_size": [3, 3, 3], "trainable": true, "padding": "same", "strides": [3, 3, 3], "name": "max_pooling3d_3", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_3", "rate": 0.5, "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "use_bias": true, "units": 512, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_1", "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_4", "rate": 0.5, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "use_bias": true, "units": 249, "name": "dense_2", "activity_regularizer": null, "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "trainable": true}}]}}