{"class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv3D", "config": {"name": "conv3d_1", "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "dtype": "float32", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1, 1], "batch_input_shape": [null, 32, 32, 16, 3], "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1, 1], "trainable": true, "use_bias": true, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_1"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_2", "activity_regularizer": null, "activation": "linear", "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1, 1], "bias_constraint": null, "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "filters": 32, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_2"}}, {"class_name": "MaxPooling3D", "config": {"strides": [3, 3, 3], "pool_size": [3, 3, 3], "name": "max_pooling3d_1", "trainable": true, "padding": "same", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.25, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Conv3D", "config": {"name": "conv3d_3", "activity_regularizer": null, "activation": "linear", "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1, 1], "bias_constraint": null, "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_3"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_4", "activity_regularizer": null, "activation": "linear", "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1, 1], "bias_constraint": null, "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_4"}}, {"class_name": "MaxPooling3D", "config": {"strides": [3, 3, 3], "pool_size": [3, 3, 3], "name": "max_pooling3d_2", "trainable": true, "padding": "same", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.25, "name": "dropout_2", "noise_shape": null}}, {"class_name": "Conv3D", "config": {"name": "conv3d_5", "activity_regularizer": null, "activation": "linear", "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1, 1], "bias_constraint": null, "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_5"}}, {"class_name": "Conv3D", "config": {"name": "conv3d_6", "activity_regularizer": null, "activation": "linear", "trainable": true, "dilation_rate": [1, 1, 1], "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1, 1], "bias_constraint": null, "kernel_size": [3, 3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_6"}}, {"class_name": "MaxPooling3D", "config": {"strides": [3, 3, 3], "pool_size": [3, 3, 3], "name": "max_pooling3d_3", "trainable": true, "padding": "same", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.5, "name": "dropout_3", "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "units": 512, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "beta_constraint": null, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "center": true}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.5, "name": "dropout_4", "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "units": 249, "activation": "softmax", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null}}], "name": "sequential_1"}, "keras_version": "2.2.4"}