{"config": {"name": "sequential_2", "layers": [{"config": {"bias_regularizer": null, "data_format": "channels_last", "name": "conv3d_5", "padding": "same", "strides": [1, 1, 1], "use_bias": true, "batch_input_shape": [null, 32, 32, 16, 1], "filters": 32, "kernel_constraint": null, "trainable": true, "dtype": "float32", "kernel_regularizer": null, "kernel_size": [3, 3, 3], "activation": "linear", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1, 1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Conv3D"}, {"config": {"name": "leaky_re_lu_5", "alpha": 0.30000001192092896, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"bias_regularizer": null, "data_format": "channels_last", "name": "conv3d_6", "padding": "same", "strides": [1, 1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3, 3], "activation": "linear", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1, 1], "activity_regularizer": null}, "class_name": "Conv3D"}, {"config": {"name": "leaky_re_lu_6", "alpha": 0.30000001192092896, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "name": "max_pooling3d_3", "padding": "same", "pool_size": [3, 3, 3], "strides": [3, 3, 3], "trainable": true}, "class_name": "MaxPooling3D"}, {"config": {"name": "dropout_4", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "data_format": "channels_last", "name": "conv3d_7", "padding": "same", "strides": [1, 1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 64, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3, 3], "activation": "linear", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1, 1], "activity_regularizer": null}, "class_name": "Conv3D"}, {"config": {"name": "leaky_re_lu_7", "alpha": 0.30000001192092896, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"bias_regularizer": null, "data_format": "channels_last", "name": "conv3d_8", "padding": "same", "strides": [1, 1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 64, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3, 3], "activation": "linear", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1, 1], "activity_regularizer": null}, "class_name": "Conv3D"}, {"config": {"name": "leaky_re_lu_8", "alpha": 0.30000001192092896, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "name": "max_pooling3d_4", "padding": "same", "pool_size": [3, 3, 3], "strides": [3, 3, 3], "trainable": true}, "class_name": "MaxPooling3D"}, {"config": {"name": "dropout_5", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "name": "dense_3", "kernel_regularizer": null, "units": 512, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"momentum": 0.99, "name": "batch_normalization_2", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "center": true, "trainable": true, "beta_constraint": null, "axis": -1, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_6", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "name": "dense_4", "kernel_regularizer": null, "units": 249, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "softmax", "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4"}