{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv3D", "config": {"dilation_rate": [1, 1, 1], "activation": "linear", "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv3d_1", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3, 3], "batch_input_shape": [null, 32, 32, 15, 3], "data_format": "channels_last", "filters": 32, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "bias_constraint": null, "strides": [1, 1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Conv3D", "config": {"dilation_rate": [1, 1, 1], "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv3d_2", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3, 3], "data_format": "channels_last", "filters": 32, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "bias_constraint": null, "strides": [1, 1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "softmax", "trainable": true}}, {"class_name": "MaxPooling3D", "config": {"pool_size": [3, 3, 3], "trainable": true, "name": "max_pooling3d_1", "padding": "same", "data_format": "channels_last", "strides": [3, 3, 3]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "noise_shape": null, "rate": 0.25, "trainable": true}}, {"class_name": "Conv3D", "config": {"dilation_rate": [1, 1, 1], "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv3d_3", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3, 3], "data_format": "channels_last", "filters": 64, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "bias_constraint": null, "strides": [1, 1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Conv3D", "config": {"dilation_rate": [1, 1, 1], "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv3d_4", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3, 3], "data_format": "channels_last", "filters": 64, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "bias_constraint": null, "strides": [1, 1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "softmax", "trainable": true}}, {"class_name": "MaxPooling3D", "config": {"pool_size": [3, 3, 3], "trainable": true, "name": "max_pooling3d_2", "padding": "same", "data_format": "channels_last", "strides": [3, 3, 3]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "seed": null, "noise_shape": null, "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 512, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "seed": null, "noise_shape": null, "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "softmax", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 101, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null}}]}, "backend": "tensorflow", "keras_version": "2.2.4"}