{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv3D", "config": {"bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "filters": 32, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dtype": "float32", "padding": "same", "batch_input_shape": [null, 32, 32, 16, 3], "dilation_rate": [1, 1, 1], "name": "conv3d_1", "use_bias": true, "kernel_size": [3, 3, 3], "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "strides": [1, 1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv3D", "config": {"bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "filters": 32, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1, 1], "name": "conv3d_2", "use_bias": true, "kernel_size": [3, 3, 3], "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "strides": [1, 1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "softmax"}}, {"class_name": "MaxPooling3D", "config": {"data_format": "channels_last", "strides": [3, 3, 3], "trainable": true, "pool_size": [3, 3, 3], "padding": "same", "name": "max_pooling3d_1"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.25, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Conv3D", "config": {"bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1, 1], "name": "conv3d_3", "use_bias": true, "kernel_size": [3, 3, 3], "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "strides": [1, 1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Conv3D", "config": {"bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "filters": 64, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1, 1], "name": "conv3d_4", "use_bias": true, "kernel_size": [3, 3, 3], "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "strides": [1, 1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "softmax"}}, {"class_name": "MaxPooling3D", "config": {"data_format": "channels_last", "strides": [3, 3, 3], "trainable": true, "pool_size": [3, 3, 3], "padding": "same", "name": "max_pooling3d_2"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.25, "noise_shape": null, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.5, "noise_shape": null, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "bias_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 101, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "name": "dense_2", "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null}}], "name": "sequential_1"}}